Autodesk.Revit.DB.TableSectionData.SetCellCombinedParameters(System.Int32,System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Allows the caller to set combined parameter for a specified column
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.SetCellCombinedParameters(System.Int32,System.Int32,System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Allows the caller to set combined parameter for a specified cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.GetCellCombinedParameters(System.Int32)
Returns an array of combined parameter data for the specified column
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.GetCellCombinedParameters(System.Int32,System.Int32)
Returns an array of combined parameter data for the specified cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.SetCellCalculatedValue(System.Int32,Autodesk.Revit.DB.TableCellCalculatedValueData)
Allows the caller to set the calculated value for a specified column
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule header sections.
-or-
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellCalculatedValue(System.Int32,System.Int32,Autodesk.Revit.DB.TableCellCalculatedValueData)
Allows the caller to set the calculated value for a specified cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule header sections.
-or-
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetCellCalculatedValue(System.Int32)
Gets the calculated value for the specified column
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.GetCellCalculatedValue(System.Int32,System.Int32)
Gets the calculated value for the specified cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.SetCellParamIdAndCategoryId(System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets a column's category and parameter Id
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
-or-
The paramId or categoryId is not acceptable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellParamIdAndCategoryId(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets a cell's category and parameter Id
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
The paramId or categoryId is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.IsAcceptableParamIdAndCategoryId(System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Identifies if the given parameter id and category id can be assigned to a cell in the given row in this table.
nRow:
row index
Returns:
True if the ParamId and CategoryId are all valid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.IsAcceptableParamIdAndCategoryId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Identifies if the given parameter id and category id can be assigned to a cell in this table.
Returns:
True if the ParamId and CategoryId are all acceptable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.GetCellCategoryId(System.Int32)
Returns a column's ParamId
Associated with the paramId to find the correct element
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.GetCellCategoryId(System.Int32,System.Int32)
Returns a cell's CategoryId and if no CategoryId exists for this cell,
it would come from the column.
Associated with the paramId to find the correct element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.GetCellParamId(System.Int32)
Returns a column's ParamId
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.GetCellParamId(System.Int32,System.Int32)
Returns a cell's ParamId and if no ParamId exists for this cell,
it would come from the column
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.SetCellFormatOptions(System.Int32,System.Int32,Autodesk.Revit.DB.FormatOptions)
Sets a cell's FormatOptions.
nRow:
The row index of the cell
nCol:
The column index of the cell
options:
The format option to assign
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
The display unit in options is not a valid display unit for the unit type of the cell, or the rounding method in options is not set to Nearest. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.TableSectionData.GetCellUnitType(System.Int32,System.Int32)
Gets the unit type of a cell, if applicable.
nRow:
The row index of the cell
nCol:
The column index of the cell
Returns:
The unit type, or UT_Undefined if the cell does not contain a number with units.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Since:
2014

Autodesk.Revit.DB.TableSectionData.IsCellFormattable(System.Int32,System.Int32)
Determines whether the cell is formattable or not
nRow:
The row index of the cell
nCol:
The column index of the cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Since:
2014

Autodesk.Revit.DB.TableSectionData.GetCellFormatOptions(System.Int32,Autodesk.Revit.DB.Document)
Returns a column's cell FormatOptions and if no FormatOptions exists for this column,
it would come from the section.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.GetCellFormatOptions(System.Int32,System.Int32,Autodesk.Revit.DB.Document)
Returns a cell's FormatOptions and if no FormatOptions exists for this cell,
it would come from the column, or the row, or the section.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.SetCellType(System.Int32,Autodesk.Revit.DB.CellType)
Sets a column's cell type
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellType(System.Int32,System.Int32,Autodesk.Revit.DB.CellType)
Sets a cell's Type
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetCellType(System.Int32)
Returns a column's cell type and if no type exists for this column,
it would come from the section
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.GetCellType(System.Int32,System.Int32)
Returns a cell's Type and if no Type exists for this cell,
it would come from the column, or the row, or the section
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.ResetCellOverride(System.Int32)
Resets the override of the column.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Since:
2014

Autodesk.Revit.DB.TableSectionData.ClearCell(System.Int32,System.Int32)
Deletes text or image, or removes parameter of this cell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.ResetCellOverride(System.Int32,System.Int32)
Resets the override of the cell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
Only allow to override cell style for header section or column header in body section.
Since:
2014

Autodesk.Revit.DB.TableSectionData.IsCellOverridden(System.Int32)
Indicates if the column is overridden or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Since:
2014

Autodesk.Revit.DB.TableSectionData.IsCellOverridden(System.Int32,System.Int32)
Indicates if the cell is overridden or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Since:
2014

Autodesk.Revit.DB.TableSectionData.SetCellStyle(Autodesk.Revit.DB.TableCellStyle)
Sets a section's style
Remarks:
For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this section.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.SetCellStyle(System.Int32,Autodesk.Revit.DB.TableCellStyle)
Sets a column's style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.SetCellStyle(System.Int32,System.Int32,Autodesk.Revit.DB.TableCellStyle)
Sets a cell's style
Remarks:
For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this cell.
The global base format controls any non-overridden characteristics of this cell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
Only allow to override cell style for header section or column header in body section.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableSectionData.AllowOverrideCellStyle(System.Int32,System.Int32)
Identifies if the style can be overridden in the given cell.
Returns:
True if allow to override cell style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Since:
2014

Autodesk.Revit.DB.TableSectionData.GetTableCellStyle(System.Int32,System.Int32)
Returns a cell's style and if no style exists for this cell,
it would come from the column, or the section
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.MergeCells(Autodesk.Revit.DB.TableMergedCell)
Merges cells for the given area.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given TableMergedCell mergedCell is outside of acceptable range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetMergedCell(System.Int32,System.Int32,Autodesk.Revit.DB.TableMergedCell)
Sets the merged cell that this cell is a part of.
nRow:
The cell row.
nCol:
The cell column.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
The given TableMergedCell mergedCell is outside of acceptable range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetMergedCell(System.Int32,System.Int32)
Gets the whole merged cell that this cell is a part of.
nRow:
The cell row.
nCol:
The cell column.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.SetCellText(System.Int32,System.Int32,System.String)
Sets a cell's to display the specified text.
Remarks:
If this cell's type is not CellType.Text, and the operation is permitted on this cell, the cell type
will be changed to type CellType.Text as a result of this call.
nRow:
The cell row.
nCol:
The cell column.
text:
The text to show in the cell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetCellText(System.Int32,System.Int32)
Returns the text shown by this cell, if the cell's type is CellType.Text or CellType.ParameterText.
Remarks:
For standard view schedules, to read the formatted text of the cell regardless of cell type,
use Autodesk::Revit::DB::ViewSchedule::GetCellText().
nRow:
The cell row.
nCol:
The cell column.
Returns:
The text in the cell, or an empty string if the type if not CellType.Text or CellType.ParameterText.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.SetRowHeightInPixels(System.Int32,System.Int32)
This sets a row's height in logical pixels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The row height is outside of acceptable range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetRowHeight(System.Int32,System.Double)
Sets a row's height in feet
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The row height is outside of acceptable range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetRowHeightInPixels(System.Int32)
This returns a row's height in logical pixels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.

Autodesk.Revit.DB.TableSectionData.GetRowHeight(System.Int32)
Returns a row's height in feet
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.

Autodesk.Revit.DB.TableSectionData.SetColumnWidthInPixels(System.Int32,System.Int32)
This sets a column's width in logical pixels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
-or-
The column width is outside of acceptable range.

Autodesk.Revit.DB.TableSectionData.SetColumnWidth(System.Int32,System.Double)
Sets a column's width in feet
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
-or-
The column width is outside of acceptable range.

Autodesk.Revit.DB.TableSectionData.GetColumnWidthInPixels(System.Int32)
This returns a column's width in logical pixels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.GetColumnWidth(System.Int32)
Returns a column's width in feet
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.RemoveColumn(System.Int32)
Removes a column data at a specified index.
nIndex:
An integer index
Throws Autodesk.Revit.Exceptions.ArgumentException:
nIndex is invalid index.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.
Since:
2014

Autodesk.Revit.DB.TableSectionData.InsertColumn(System.Int32)
Inserts a new column at the specified index relative to the current set of columns.
index:
An integer index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is invalid index.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.
Since:
2015

Autodesk.Revit.DB.TableSectionData.CanRemoveColumn(System.Int32)
Verifies that if the column at the given index can be removed.
nIndex:
An integer index.
Returns:
True if the column can be removed, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableSectionData.CanInsertColumn(System.Int32)
Verifies if a new column can be inserted at the given index.
nIndex:
An integer index.
Returns:
True if the column can be inserted, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableSectionData.RemoveRow(System.Int32)
Removes a row data at a specified index.
nIndex:
An integer index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The row can't be removed because it's an element in linked file, default zone
or it's a row in body section of Material Quantity Take Off Schedule
or it's the last row in header section of standard schedule
or nIndex is invalid index.
Since:
2014

Autodesk.Revit.DB.TableSectionData.InsertRow(System.Int32)
Inserts a row data at a specified index.
nIndex:
An integer index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The row can't be inserted in data section of standard schedule except Key Schedule, Sheet List Schedule
or following categories without emdeded schedule: MEP Space, Room, Area.
or nIndex is invalid index.
Since:
2014

Autodesk.Revit.DB.TableSectionData.CanRemoveRow(System.Int32)
Verifies that if the row at the given index can be removed..
nIndex:
An integer index.
Returns:
True if the row can be removed, false otherwise
Since:
2014

Autodesk.Revit.DB.TableSectionData.CanInsertRow(System.Int32)
Verifies if a new row can be inserted at the given index.
Returns:
True if the row can be inserted, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableSectionData.IsValidImageSymbolId(Autodesk.Revit.DB.ElementId)
Identifies if the element id represents a valid ImageSymbol element.
imageSymbolId:
The element id of the image symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.TableSectionData.InsertImage(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId)
Inserts a image in the given cell.
nRow:
The given row index.
nColumn:
The given column index.
imageSymbolId:
The element id of the image symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nColumn is invalid.
-or-
The image symbol id doesn't represent a valid image symbol element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.TableSectionData.IsValidRowNumber(System.Int32)
Verifies if the row number is valid.
nRow:
The row number.
Returns:
True if the row number is between FirstRowNumber and LastRowNumber, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableSectionData.IsValidColumnNumber(System.Int32)
Verifies if the column number is valid.
nCol:
The column number.
Returns:
True if the column number is between FirstColumnNumber and LastColumnNumber, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableSectionData.RefreshData
Rebuilds the data in this section if it is out of date.
Returns:
True if the data is up to date after the refresh.
Since:
2014

Autodesk.Revit.DB.TableSectionData.IsDataOutOfDate
Indicates whether the data in this section is out of date.
Remarks:
To improve performance, some TableViews may contain TableSections that are only updated on demand.  For example,
the body section of a schedule is not updated when the ViewSchedule is closed.  In this case, you need to call
RefreshData to avoid getting the stale data.
Returns:
True if the data in this section is out of date, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableSectionData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableSectionData.NeedsRefresh
Indicates if the table data need to refresh.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.NumberOfRows
Gets or sets the number of items in row data array.
Remarks:
Note that TableSections may use either 0 or 1 as the first row and column indices.  To access the rows and columns:
Use FirstRowNumber and LastRowNumber to get the valid range of row indices.  Use FirstColumnNumber and LastColumnNumber to get the valid range of column indices.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.LastRowNumber
The last row in this section of the table.
Since:
2014

Autodesk.Revit.DB.TableSectionData.FirstRowNumber
The first row in this section of the table.
Remarks:
Some table sections have row 0 as their first row while others start with row 1.
Since:
2014

Autodesk.Revit.DB.TableSectionData.LastColumnNumber
The last column in this section of the table.
Since:
2014

Autodesk.Revit.DB.TableSectionData.FirstColumnNumber
The first column in this section of the table.
Remarks:
Some table sections have column 0 as their first column while others start with column 1.
Since:
2014

Autodesk.Revit.DB.TableSectionData.NumberOfColumns
Gets or sets the number of items in column data array.
Remarks:
Note that TableSections may use either 0 or 1 as the first row and column indices.  To access the rows and columns:
Use FirstRowNumber and LastRowNumber to get the valid range of row indices.  Use FirstColumnNumber and LastColumnNumber to get the valid range of column indices.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.HideSection
Whether or not the section is hidden.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData
The TableSectionData class represents a serialized version of an instance of
section table data. The class holds row, column and cell data.